int_array.xml

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope 
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<!-- http://www.w3.org/2003/05/soap-envelope -->
  <soapenv:Body>
    <m:intArrayTest xmlns:m="org.scalabound.test"> 
      <numbers soapenv:arrayType="xsd:int[2]">
        <!-- <soapenv:int>4</soapenv:int>-->
        <item>3</item>
        <item>4</item>
      </numbers>
   </m:intArrayTest> 
  </soapenv:Body>
</soapenv:Envelope>

